Revit 2027 API
ExternalServices.BuiltInExternalServices.SiteLinkerUIService Property
 The external UI service which permits registration of an alternate servers for new UI of link topography
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId SiteLinkerUIService { get; }
Public Shared ReadOnly Property SiteLinkerUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ SiteLinkerUIService {
	ExternalServiceId^ get ();
}
static member SiteLinkerUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace